OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16c781.h
extern __at(0x011A) volatile __CM2CON0bits_t CM2CON0bits;

#define _C2CH0                  0x01
#define _C2CH1                  0x02
#define _C2R                    0x04
#define _C2SP                   0x08
#define _C2POL                  0x10
#define _C2OE                   0x20
#define _C2OUT                  0x40
#define _C2ON                   0x80

//==============================================================================


//==============================================================================
//        CM2CON1 Bits

extern __at(0x011B) __sfr CM2CON1;

typedef struct
  {
  unsigned C2SYNC               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned MC2OUT               : 1;
  unsigned MC1OUT               : 1;
  } __CM2CON1bits_t;

extern __at(0x011B) volatile __CM2CON1bits_t CM2CON1bits;

#define _C2SYNC                 0x01
#define _MC2OUT                 0x40
#define _MC1OUT                 0x80

//==============================================================================


//==============================================================================
//        OPACON Bits

extern __at(0x011C) __sfr OPACON;

typedef struct
  {
  unsigned GBWP                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned CMPEN                : 1;
  unsigned OPAON                : 1;
  } __OPACONbits_t;

extern __at(0x011C) volatile __OPACONbits_t OPACONbits;

#define _GBWP                   0x01
#define _CMPEN                  0x40
#define _OPAON                  0x80

//==============================================================================


//==============================================================================
//        DAC Bits

extern __at(0x011E) __sfr DAC;

typedef struct
  {
  unsigned DA0                  : 1;
  unsigned DA1                  : 1;
  unsigned DA2                  : 1;
  unsigned DA3                  : 1;
  unsigned DA4                  : 1;
  unsigned DA5                  : 1;
  unsigned DA6                  : 1;
  unsigned DA7                  : 1;
  } __DACbits_t;

extern __at(0x011E) volatile __DACbits_t DACbits;

#define _DA0                    0x01
#define _DA1                    0x02
#define _DA2                    0x04
#define _DA3                    0x08
#define _DA4                    0x10
#define _DA5                    0x20
#define _DA6                    0x40
#define _DA7                    0x80

//==============================================================================


//==============================================================================
//        DACON0 Bits

extern __at(0x011F) __sfr DACON0;

typedef union
  {
  struct
    {
    unsigned DARS0              : 1;
    unsigned DARS1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DAOE               : 1;
    unsigned DAON               : 1;
    };

  struct
    {
    unsigned DARS               : 2;
    unsigned                    : 6;
    };
  } __DACON0bits_t;

extern __at(0x011F) volatile __DACON0bits_t DACON0bits;

#define _DARS0                  0x01
#define _DARS1                  0x02
#define _DAOE                   0x40
#define _DAON                   0x80

//==============================================================================


//==============================================================================
//        PMCON1 Bits

extern __at(0x018C) __sfr PMCON1;

typedef struct
  {
  unsigned RD                   : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PMCON1bits_t;

extern __at(0x018C) volatile __PMCON1bits_t PMCON1bits;

#define _RD                     0x01

//==============================================================================


//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG1                0x2007

//----------------------------- CONFIG1 Options -------------------------------

#define _FOSC_LP                0x3FF8  // LP oscillator.
#define _LP_OSC                 0x3FF8  // LP oscillator.
#define _FOSC_XT                0x3FF9  // XT oscillator.
#define _XT_OSC                 0x3FF9  // XT oscillator.
#define _FOSC_HS                0x3FFA  // HS oscillator.
#define _HS_OSC                 0x3FFA  // HS oscillator.
#define _FOSC_EXTCLK            0x3FFB  // EC I/O.
#define _EXTCLK_OSC             0x3FFB  // EC I/O.
#define _FOSC_INTRCIO           0x3FFC  // INTRC, OSC2 is I/O.
#define _INTRC_OSC_NOCLKOUT     0x3FFC  // INTRC, OSC2 is I/O.
#define _FOSC_INTRCCLK          0x3FFD  // INTRC, clockout on OSC2.
#define _INTRC_OSC_CLKOUT       0x3FFD  // INTRC, clockout on OSC2.
#define _FOSC_ER_NOCLKOUT       0x3FFE  // RC I/O.
#define _ER_OSC_NOCLKOUT        0x3FFE  // RC I/O.
#define _FOSC_ER_CLKOUT         0x3FFF  // RC CLKOUT.
#define _ER_OSC_CLKOUT          0x3FFF  // RC CLKOUT.
#define _WDTE_OFF               0x3FF7  // WDT disabled.
#define _WDT_OFF                0x3FF7  // WDT disabled.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FEF  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _MCLRE_OFF              0x3FDF  // Internal.
#define _MCLRE_ON               0x3FFF  // External.
#define _BOREN_OFF              0x3FBF  // BOR disabled.
#define _BODEN_OFF              0x3FBF  // BOR disabled.
#define _BOREN_ON               0x3FFF  // BOR enabled.
#define _BODEN_ON               0x3FFF  // BOR enabled.
#define _CP_ALL                 0x0CFF  // All memory is code protected.
#define _CP_OFF                 0x3FFF  // Code protection off.
#define _BODENV_45              0x33FF  // VBOR set to 4.5V.
#define _VBOR_45                0x33FF  // VBOR set to 4.5V.
#define _BODENV_42              0x37FF  // VBOR set to 4.2V.
#define _VBOR_42                0x37FF  // VBOR set to 4.2V.
#define _BODENV_27              0x3BFF  // VBOR set to 2.7V.
#define _VBOR_27                0x3BFF  // VBOR set to 2.7V.
#define _BODENV_25              0x3FFF  // VBOR set to 2.5V.
#define _VBOR_25                0x3FFF  // VBOR set to 2.5V.

//==============================================================================

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

